nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/driver_examples/flexio/spi/int_lpspi_transfer/slave/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

 #ifndef _PIN_MUX_H_
 #define _PIN_MUX_H_
 
 /*!
  * @addtogroup pin_mux
  * @{
  */
 
 /***********************************************************************************************************************
  * API
  **********************************************************************************************************************/
 
 #if defined(__cplusplus)
 extern "C" {
 #endif
 
 /*!
  * @brief Calls initialization functions.
  *
  */
 void BOARD_InitBootPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitDEBUG_UARTPins(void);
 
 #define PORT_DFER_DFE_0_MASK 0x01u /*!<@brief Digital Filter Enable Mask for item 0. */
 #define PORT_DFER_DFE_2_MASK 0x04u /*!<@brief Digital Filter Enable Mask for item 2. */
 #define PORT_DFER_DFE_3_MASK 0x08u /*!<@brief Digital Filter Enable Mask for item 3. */
 #define PORT_DFER_DFE_6_MASK 0x40u /*!<@brief Digital Filter Enable Mask for item 6. */
 
 /*! @name PORTB3 (number 63), LPSPI0_SIN/SIN
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITSPIPINS_LPSPI0_SIN_PORT PORTB               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITSPIPINS_LPSPI0_SIN_PIN 3U                   /*!<@brief PORT pin number */
 #define BOARD_INITSPIPINS_LPSPI0_SIN_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */
 
 /*! @name PORTE2 (number 122), LPSPI0_SOUT/LPSPI0_SIN
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITSPIPINS_LPSPI0_SOUT_PORT PORTE               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITSPIPINS_LPSPI0_SOUT_PIN 2U                   /*!<@brief PORT pin number */
 #define BOARD_INITSPIPINS_LPSPI0_SOUT_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                /* @} */
 
 /*! @name PORTE0 (number 138), LPSPI0_SCK
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITSPIPINS_LPSPI0_SCK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITSPIPINS_LPSPI0_SCK_PIN 0U                   /*!<@brief PORT pin number */
 #define BOARD_INITSPIPINS_LPSPI0_SCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                               /* @} */
 
 /*! @name PORTE6 (number 121), LPSPI0_PCS2
   @{ */
 
 /* Symbols to be used with PORT driver */
 #define BOARD_INITSPIPINS_LPSPI0_PCS2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITSPIPINS_LPSPI0_PCS2_PIN 6U                   /*!<@brief PORT pin number */
 #define BOARD_INITSPIPINS_LPSPI0_PCS2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitSPIPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitFLEXIOPins(void);
 
 #if defined(__cplusplus)
 }
 #endif
 
 /*!
  * @}
  */
 #endif /* _PIN_MUX_H_ */
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 